ExampleMessages/HL7v2-ORUR01.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Body xmlns:m="http://192.168.163.129/medical_warehouse/warehouse.php">
  <m:ingest_file>
    <m:clientId>Sam_Test</m:clientId>
    <m:md5>81dc9bdb52d04dc20036dbd8313ed055</m:md5>
    <m:format>HL7v2</m:format>
    <m:payload><![CDATA[MSH|^~\`|674|GHC|SISRL|PAML|20060922162830|L674-200609221628310220|ORU^R01|ORU000016168|P|2.3|||AL |AL
PID|1||1478895^4^M10^PA||XTEST^PATIENT^||19591123| F||||||||||||||||||||||
ORC|RE|F4334|51013174200601|||||^||||||||||||||||
OBR|1|F4334|51013174200601|80048^BASIC METABOLIC PANEL|||20060922152300||||||||^^^^^|023901^PACLAB| ||||||^|CH|F|^^|^^^20060922162659^^GHA||^|||^^^^^^ ^^^^|^^^^^^^^^^|^^^^^^^^^^|^^^^^^^^^^||||||||||
OBX|1|NM|84295^SODIUM^GH|1|145|mmol/L|||||F|||20060922152300|GH
OBX|2|NM|84132^POTASSIUM^GH|2|5.2|mmol/L|||||F|||20060922152300|GH
OBX|3|NM|82435^CHLORIDE^GH|3|108|mmol/L|||||F|||20060922152300|GH
OBX|4|NM|82374^CARBON DIOXIDE^GH|4|31|mmol/L|||||F|||20060922152300|GH
OBX|5|NM|82947^GLUCOSE^GH|5|76|MG/DL|||||F|||20060922152300|GH
OBX|6|NM|84520^BUN^GH|6|22|MG/DL|||||F|||20060922152300|GH
OBX|7|NM|82565^CREATININE^GH^2160-0^CREATININE:MCNC:PT:SER/PLAS:QN:^LN|7|1.3|MG/DL|||||F|||20060922152300|GH
OBX|8|NM|82310^CALCIUM^GH|8|10.1|MG/DL|||||F|||20060922152300|GH
OBX|9|NM|GFR-AA*H^GFR--AFRICAN AMERICAN^GH|9|46|ML/MIN|||||F|||20060922152300|GH
OBX|10|NM|GFR*H^GFR--NON-AFRICAN AMERICAN^GH|10|46|ML/MIN|||||F|||20060922152300|GH
OBX|11|ST|84999.Z159||DNR||||||F||||GH
OBX|12|NM|84999.Z174^Anion Gap||6|mmol/L|||F]]></m:payload>
<m:batchId>HL7v2TESTS</m:batchId>
  </m:ingest_file>
</soap:Body>
</soap:Envelope>